tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
brew "autoconf"
brew "automake"
brew "basedpyright"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "btop"
brew "cask"
brew "cmake"
brew "dockerfile-language-server"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "git-delta"
brew "gitui"
brew "go"
brew "gopls"
brew "gping"
brew "grip"
brew "hyperfine"
brew "mpg123"
brew "neovim"
brew "pkgconf"
brew "poppler"
brew "procs"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-c9rgreen-sonoma-icon", "with-xwidgets"]
cask "captin"
cask "cheatsheet"
cask "fliqlo"
cask "font-lxgw-neoxihei"
cask "font-lxgw-wenkai"
cask "font-sf-mono"
cask "foobar2000"
cask "hiddenbar"
cask "jellyfin-media-player"
cask "karabiner-elements"
cask "licecap"
cask "listen1"
cask "macgesture"
cask "maczip"
cask "monitorcontrol"
cask "mos"
cask "squirrel"
cask "streammusic"
cask "upscayl"
cask "windows-app"
cask "youdaodict"
cask "youdaonote"
vscode "anysphere.pyright"
vscode "ecmel.vscode-html-css"
vscode "golang.go"
vscode "mattn.lisp"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
