tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"

brew "bat"
brew "bottom"
brew "btop"
brew "coreutils"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gitui"
brew "go"
brew "gping"
brew "hyperfine"
brew "mas"
brew "mpg123"
brew "procs"
brew "ripgrep"
brew "rust"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tmux"                     # zellij
brew "topgrade"
brew "watchexec"
brew "yazi"
brew "zoxide"

brew "bash-language-server"
brew "dockerfile-language-server"
brew "gopls"
brew "python-lsp-server"
brew "rust-analyzer"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

brew "opencode"
# brew "neovim"

cask "emacs-plus-app"
# cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
# cask "font-hack-nerd-font"
cask "font-lxgw-neoxihei"
cask "font-lxgw-wenkai"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"

cask "fliqlo"                   # screensaver
cask "foobar2000"
cask "hiddenbar"
cask "karabiner-elements"
cask "licecap"
cask "macgesture"
cask "maczip"
# cask "better-display"
# cask "monitorcontrol"
cask "mos"
# cask "musiver"
# cask "paper"                    # wallpaper
cask "squirrel-app"
cask "upscayl"
# cask "windows-app"
cask "youdaodict"
# cask "youdaonote"

vscode "ecmel.vscode-html-css"
vscode "golang.go"
vscode "mattn.lisp"
vscode "ms-python.python"
vscode "tuttieee.emacs-mcx"
